Repository: usaeducation/usaeducation.github.io
Catalog: !drupal/db/sites/all/modules/admin_menu/translations/admin_menu-all-*.po
Languages: ru

source: Weight
ru: Вес

source: Administration
ru: Администрирование

source: Path
ru: Адрес

source: Home
ru: Главная

source: System
ru: Система

source: Administer
ru: Управление

source: Run cron
ru: Запустить выполнение регулярных процедур

source: Log out
ru: Выйти

source: Advanced settings
ru: Расширенные настройки

source: Administration Menu settings
ru: Настройки Меню Администрирования

source: Display all menu items
ru: Отобразить все пункты меню

source: Enable this option to disable user access checks for menu items, i.e. every menu item in the visible menu tree will be displayed to every user regardless of access permissions.
ru: Включите эту опцию для отключения проверки прав пользователя для пунктов меню, т.е. каждый пункт меню будет показываться любому пользователю, независимо от прав доступа.

source: access administration menu
ru: доступ к меню управления

source: Renders the administer menu tree as dropdown menu at the top of the window.
ru: Создает сверху страницы выпадающее меню администрирования.

source: None
ru: Нет

source: Menu
ru: Меню

source: Add content
ru: Добавить содержимое

source: Add !title
ru: Создать !title

source: Administration Menu
ru: Администрирование

source: Run updates
ru: Запустить обновления

source: Drupal issue queue
ru: Очередь ошибок Drupal

source: @title issue queue
ru: @title очередь ошибок

source: Logout @name
ru: @name, выйти

source: Current anonymous / authenticated users
ru: Сейчас гостей / зарегистрированных пользователей

source: Parent id
ru: ID родителя

source: Display extra information for menu items in Drupal Administration Menu
ru: Показывать дополнительную информацию в пунктах Меню Администрирования Drupal

source: If enabled, the chosen information will appear next to each menu item link.
ru: Если включено, выбранная информация будет появляться рядом с каждым пунктом меню.

source: Variable editor
ru: Редактор переменных

source: Empty cache
ru: Очистить кэш

source: display drupal links
ru: показать drupal ссылки

source: Renders a menu tree for administrative purposes as dropdown menu at the top of the window.
ru: Создаёт иерархическое меню для административных целей в виде выпадающего меню на верху окна.

source: Theme registry
ru: Реестр функций оформления

source: Find content
ru: Искать содержимое

source: Logout
ru: Выход

source: The Administration Menu will appear at the top of the page for users who have been given the "access administration menu" permission. Customize appearance of the dropdown menu here.
ru: Меню администрирования появится вверху страницы для пользователей, имеющих право "доступ к меню администратора". Настройте внешность выпадающего меню ниже.

source: Apply margin-top to page body
ru: Применить отступ сверху к телу страницы

source: Adjust settings for the dropdown Administration Menu.
ru: Скорректировать параметры для всплывающего Меню Администрирования.

source: Edit !name
ru: Редактировать !name

source: Enable developer modules
ru: Включить dev модули

source: Disable developer modules
ru: Отключить dev модули

source: If enabled, the output of this site will be shifted for approx. 20 pixels from the top of the viewport to make room for the Administration Menu. If this setting is disabled, some absolute or fixed positioned page elements at the top of the viewport may be covered by Administration Menu.
ru: Если включено, вывод этого сайта будет сдвинут вниз примерно на 20 пикселей от верха области просмотра для создания места и отображения Меню Администрирования . Если эта опция выключено, некоторые элементы страницы с фиксированным или абсолютным расположением сверху области просмотра могут быть перекрыты Меню Администрирования .

source: Drupal Administration Tweaks
ru: Достижения Администрирования Drupal

source: Collapse fieldsets on modules page
ru: Свернуть группы на странице модулей

source: If enabled, fieldsets on the <a href="!modules-url">Site building &raquo; Modules</a> page will be initially collapsed.
ru: Если включено, наборы полей на странице <a href="!modules-url">Конструкция сайта &raquo; Модули</a> будут первоначально свернуты.

source: If you installed Utility module for this purpose, you can safely uninstall it now!
ru: Если вы устанавливали Сервисный модуль с этой целью, теперь вы можете благополучно его деинсталировать!

source: Collapse menus in menu administration
ru: Сворачивать меню в меню администрирования

source: If enabled, menu containers on the <a href="!menu-url">Site building &raquo; Menus</a> page will be collapsed like fieldsets.
ru: Если включено, контейнеры меню на странице <a href="!menu-url">Конструкция сайта &raquo; Меню</a> будут свернуты как набор полей.

source: Re-enabled these modules: !module-list.
ru: Снова включить эти модули: !module-list.

source: Disabled these modules: !module-list.
ru: Отключить эти модули: !module-list.

source: No developer modules are enabled.
ru: Модули dev не включены

source: "%" may not be used for the first segment of a path.
ru: "%" не может быть использован в качестве первого сегмента пути.

source: Wipe and rebuild
ru: Восстановить

source: Access administration menu
ru: Доступ к меню администратора

source: Use fixed instead of absolute positioning
ru: Использовать фиксированное расположение вместо абсолютного

source: If enabled, the administration menu will always stay at the top of the browser viewport, even if you scroll down the page.
ru: Если включено, меню администрирования будет всегда оставаться наверху области просмотра браузера, даже если вы прокручиваете страницу.

source: <strong>Note:</strong> In some browsers this setting might cause malformed page contents, a disappearing cursor and not editable select lists in forms. If such effects occur, this setting should be disabled.
ru: <strong> Отметьте:</strong> В некоторых браузерах такая настройка может бы вызвать уродливое содержание страницы, исчезающий курсор и нередактируемые списки выбора в формах. Если такие эффекты происходят, эта настройка должна быть отключена.

source: Move page tabs into administration menu
ru: Переместить вкладки страницы в меню администрирования

source: If enabled, tabs of the current page (usually displayed next or below the page title) will be moved into the administration menu. This feature requires that the theme is using the CSS classes <code>tabs primary</code> and <code>tabs secondary</code> for tabs (like Garland).
ru: Если включено, вкладки на текущей странице (обычно отображаются рядом или ниже от заголовка страницы) будут перенесены в меню управления. Эта особенность требует, чтобы тема использовала классы CSS <code>tabs primary</code> and <code>tabs secondary</code> для вкладок (как в Garland).

source: Adjust top margin
ru: Применить верхний отступ

source: If enabled, the site output is shifted down approximately 20 pixels from the top of the viewport to display the administration menu. If disabled, some absolute- or fixed-positioned page elements may be covered by the administration menu.
ru: Если включено, вывод сайта сдвинется вниз приблизительно на 20 пикселей от вершины области просмотра, чтобы отобразить меню управления. Если выключено, некоторые элементы страницы с абсолютным или фиксированным положением могут быть перекрыты этим меню.

source: Keep menu at top of page
ru: Закрепить меню сверху страницы

source: If enabled, the administration menu is always displayed at the top of the browser viewport (even after the page is scrolled). <strong>Note: In some browsers, this setting results in a malformed page, an invisible cursor, non-selectable elements in forms, or other issues. Disable this option if these issues occur.</strong>
ru: Если включено, меню управления будет всегда отображаться сверху области просмотра браузера (даже после прокрутки страницы). <strong>Примечание: В некоторых браузерах эта установка приведет к искаженной странице, невидимому курсору, невыбираемым элементам форм, или другим проблемам. Отключите эту опцию, если эти проблемы происходят.</strong>

source: If enabled, fieldsets on the <a href="!modules-url">modules</a> page are automatically collapsed when loading the page.
ru: Если включено, группы на странице <a href="%21modules-url">модули</a> автоматически свернуться при загрузке страницы.

source: If the Utility module was installed for this purpose, it can be safely disabled and uninstalled.
ru: Если Сервисный модуль был установлен с этой целью, он может быть безопасно отключен и удален.

source: Move local tasks into menu
ru: Перенести локальные задачи в меню

source: If enabled, the tabs on the current page are moved into the administration menu. This feature is only available in themes that use the CSS classes <code>tabs primary</code> and <code>tabs secondary</code> for tabs.
ru: Если включено, вкладки на текущей странице переместятся в меню управления. Эта особенность доступна только в темах, которые используют CSS классы <code>tabs primary</code> и <code>tabs secondary</code> для вкладок.

source: If the administration menu displays duplicate menu items, you may need to rebuild your menu items using the <em>Wipe and rebuild</em> button.
ru: Если меню управления отображает дубликаты элементов меню, вам может потребоваться восстановить ваши элементы меню, используя кнопку <em>Восстановить</em>

source: Administration menu settings
ru: Настройки меню управления

source: Menu link ID
ru: ID ссылки меню

source: Parent link ID
ru: ID дочерней ссылки

source: Display additional data for each menu item
ru: Показать дополнительные данные для каждого элемента меню

source: Display the selected items next to each menu item link.
ru: Показать выбранные элементы рядом с каждой ссылкой пункта меню.

source: If enabled, all menu items are displayed regardless of your site permissions. <em>Note: Do not enable on a production site.</em>
ru: Если включено, все пункты меню отобразятся независимо от разрешений сайта. <em>Примечание: не включать на рабочем сайте.</em>

source: Enabled these modules: !module-list.
ru: Включить эти модули: !module-list.

source: The administration menu module provides a dropdown menu arranged for one- or two-click access to most administrative tasks and other common destinations (to users with the proper permissions). Use the settings below to customize the appearance of the menu.
ru: Модуль меню управления обеспечивает, всплывающее меню, помогающее всего за один - или два щелчка обратится к большинству административных задач и другим общим адресатам (пользователям с надлежащими разрешениями). Используйте настройки ниже, чтобы настроить появление меню.

source: The administration menu module provides a dropdown menu arranged for one- or two-click access to most administrative tasks and other common destinations (to users with the proper permissions). Administration menu also displays the number of anonymous and authenticated users, and allows modules to add their own custom menu items. Integration with the menu varies from module to module; the contributed module <a href="@drupal">Devel</a>, for instance, makes strong use of the administration menu module to provide quick access to development tools.
ru: Модуль меню управления обеспечивает, всплывающее меню, помогающее всего за один - или два щелчка обратится к большинству административных задач и другим общим адресатам (пользователям с надлежащими разрешениями). Меню управления также отображает число анонимных и зарегистрированных пользователей, и позволяет модулям добавлять их собственные пункты меню. Интеграция с меню изменяется от модуля к модулю; например, дополнительный модуль <a href="@drupal">Devel</a>, делает использование модуля меню управления мощьным, чтобы обеспечить быстрый доступ к инструментальным средствам разработки.

source: The administration menu <a href="@settings">settings page</a> allows you to modify some elements of the menu's behavior and appearance. Since the appearance of the menu is dependent on your site theme, substantial customizations require modifications to your site's theme and CSS files. See the advanced module README.txt file for more information on theme and CSS customizations.
ru: <a href="@settings">Страница настройки</a> меню управления позволяет вам изменять некоторые элементы поведения и появления меню. Так как появление меню зависит от темы вашего сайта, существенные настройки требуют изменения темы вашего сайта и файлов CSS. Смотри файл README.txt расширенного модуля для получения дополнительной информации о теме и настройках CSS.

source: The menu items displayed in the administration menu depend upon the actual permissions of the viewer. First, the administration menu is only displayed to users in roles with the <em>Access administration menu</em> (admin_menu module) permission. Second, a user must be a member of a role with the <em>Access administration pages</em> (system module) permission to view administrative links. And, third, only currently permitted links are displayed; for example, if a user is not a member of a role with the permissions <em>Administer permissions</em> (user module) and <em>Administer users</em> (user module), the <em>User management</em> menu item is not displayed.
ru: Пункты меню, показанные в меню управления зависят от фактических разрешений пользователя. Во-первых, меню управления показывается только пользователям с разрешением ролей <em>Доступ к меню управления</em> (admin_menu модуль) . Во вторых, пользователь должен быть членом роли с разрешением <em>Доступ к страницам управления</em> (модуль system), чтобы просматривать административные ссылки. И, третье, только в настоящее время разрешено, чтобы ссылки были показаны; например, если пользователь не член роли с разрешениями <em>Управление разрешениями</em> (модуль user) и <em> Управление пользователями</em> (модуль user), <em>Управление пользователями</em> пункт меню не показан.

source: Adjust administration menu settings.
ru: Приспособьте параметры настройки меню администрации.

source: Provides a dropdown menu to most administrative tasks and other common destinations (to users with the proper permissions).
ru: Добавляет всплывающее меню для большинства административных и других общих задач (для пользователей с соответствующими правами).

source: Display the administration menu at the top of each page.
ru: Отображать Меню Администрирования вверху каждой страницы.

source: Display Drupal links
ru: Отображать ссылки Drupal

source: Provide Drupal.org links in the administration menu.
ru: Показывать ссылки Drupal.org в Меню Администрирования.

source: @project issue queue
ru: @project очередь ошибок

source: Flush all caches
ru: Очистить все кэши

source: Cache tables
ru: Кэш таблиц

source: Page requisites
ru: Реквизиты страницы

source: Show shortcuts
ru: Показать сочетания клавиш

source: Hello <strong>@username</strong>
ru: Здравствуйте, <strong>@username</strong>.

source: Developer modules to keep enabled
ru: Держать включенными dev модули

source: Enabled developer modules in this list will not be disabled when the link <em>Disable developer modules</em> in the menu below the icon is invoked.
ru: Разрешить dev модулям из этого списка не отключаться при вызове ссылки <em>Отключить dev модули</em> в меню под иконкой.

source: Administration menu Toolbar style
ru: Административное меню панели инструментов стиля

source: A better Toolbar.
ru: Улучшенная Панель инструментов.

source: Administration views
ru: Административное представление

source: Replaces all system object management pages in Drupal core with real views.
ru: Заменяет Drupal систему управления страницами в ядре представлениями.

source: Administration tools.
ru: Средства администрирования.

source: Class registry
ru: Класс реестра

source: Flush caches
ru: Очистить кэш

source: Access links to flush caches in the administration menu.
ru: Доступ к ссылкам сброса кэша в меню управления.

source: Collapse modules on permissions page
ru: Конфликт модулей на странице разрешений

source: Collapses permissions by module on the <a href="@permissions-url">permissions</a> page.
ru: Конфликты разрешений модуля на <a href="@permissions-url">странице разрешений</a>

source: Administration Development tools
ru: Административно-отладочные инструменты

source: Administration and debugging functionality for developers and site builders.
ru: Административная и отладочная функциональность для разработчиков и сайтостроителей.

source: Display the view as replacement for an existing menu path.
ru: Отображает представление как замену существующему пути меню.

source: System path settings
ru: Настройки системного пути

source: An existing menu path this view replaces
ru: Существующее меню заменяет это представление.

source: This view replaces this path on your site. You may use "%" for dynamic arguments. For example: "node/%/feed".
ru: Это представление заменяет этот путь на вашем сайте. Вы можете использовать "%" для динамических аргументов. Например: "node/%/feed".

source: Rebuild system links
ru: Восстановить системные ссылки
